Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/cassandra2-cql_workloada_200000_run_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 105709.0
[OVERALL], Throughput(ops/sec), 1891.9864912164528
[TOTAL_GCS_PS_Scavenge], Count, 20.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 373.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3528554806118684
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 20.0
[TOTAL_GC_TIME], Time(ms), 373.0
[TOTAL_GC_TIME_%], Time(%), 0.3528554806118684
[READ], Operations, 99711.0
[READ], AverageLatency(us), 551.7225581931783
[READ], MinLatency(us), 278.0
[READ], MaxLatency(us), 251775.0
[READ], 95thPercentileLatency(us), 676.0
[READ], 99thPercentileLatency(us), 1244.0
[READ], Return=OK, 99711
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2241536.0
[CLEANUP], MinLatency(us), 2240512.0
[CLEANUP], MaxLatency(us), 2242559.0
[CLEANUP], 95thPercentileLatency(us), 2242559.0
[CLEANUP], 99thPercentileLatency(us), 2242559.0
[UPDATE], Operations, 100289.0
[UPDATE], AverageLatency(us), 448.0332439250566
[UPDATE], MinLatency(us), 211.0
[UPDATE], MaxLatency(us), 49887.0
[UPDATE], 95thPercentileLatency(us), 556.0
[UPDATE], 99thPercentileLatency(us), 775.0
[UPDATE], Return=OK, 100289