Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/cassandra2-cql_workloada_400000_run_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 198887.0
[OVERALL], Throughput(ops/sec), 2011.1922850663946
[TOTAL_GCS_PS_Scavenge], Count, 173.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 875.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4399483123582738
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 173.0
[TOTAL_GC_TIME], Time(ms), 875.0
[TOTAL_GC_TIME_%], Time(%), 0.4399483123582738
[READ], Operations, 200492.0
[READ], AverageLatency(us), 557.0794096522554
[READ], MinLatency(us), 265.0
[READ], MaxLatency(us), 866815.0
[READ], 95thPercentileLatency(us), 676.0
[READ], 99thPercentileLatency(us), 1279.0
[READ], Return=OK, 200492
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2239488.0
[CLEANUP], MinLatency(us), 2238464.0
[CLEANUP], MaxLatency(us), 2240511.0
[CLEANUP], 95thPercentileLatency(us), 2240511.0
[CLEANUP], 99thPercentileLatency(us), 2240511.0
[UPDATE], Operations, 199508.0
[UPDATE], AverageLatency(us), 411.1911001062614
[UPDATE], MinLatency(us), 208.0
[UPDATE], MaxLatency(us), 95423.0
[UPDATE], 95thPercentileLatency(us), 498.0
[UPDATE], 99thPercentileLatency(us), 657.0
[UPDATE], Return=OK, 199508