Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/cassandra2-cql_workloada_800000_run_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 363558.0
[OVERALL], Throughput(ops/sec), 2200.474202190572
[TOTAL_GCS_PS_Scavenge], Count, 658.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1309.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3600525913334323
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 658.0
[TOTAL_GC_TIME], Time(ms), 1309.0
[TOTAL_GC_TIME_%], Time(%), 0.3600525913334323
[READ], Operations, 280137.0
[READ], AverageLatency(us), 528.3093700582215
[READ], MinLatency(us), 252.0
[READ], MaxLatency(us), 1222655.0
[READ], 95thPercentileLatency(us), 639.0
[READ], 99thPercentileLatency(us), 820.0
[READ], Return=OK, 280137
[READ], Return=NOT_FOUND, 119397
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2243584.0
[CLEANUP], MinLatency(us), 2242560.0
[CLEANUP], MaxLatency(us), 2244607.0
[CLEANUP], 95thPercentileLatency(us), 2244607.0
[CLEANUP], 99thPercentileLatency(us), 2244607.0
[READ-FAILED], Operations, 119397.0
[READ-FAILED], AverageLatency(us), 404.82586664656566
[READ-FAILED], MinLatency(us), 208.0
[READ-FAILED], MaxLatency(us), 49503.0
[READ-FAILED], 95thPercentileLatency(us), 488.0
[READ-FAILED], 99thPercentileLatency(us), 615.0
[UPDATE], Operations, 400466.0
[UPDATE], AverageLatency(us), 398.82087867634203
[UPDATE], MinLatency(us), 201.0
[UPDATE], MaxLatency(us), 58143.0
[UPDATE], 95thPercentileLatency(us), 482.0
[UPDATE], 99thPercentileLatency(us), 597.0
[UPDATE], Return=OK, 400466