Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/cassandra2-cql_workloadf_200000_run_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 140359.0
[OVERALL], Throughput(ops/sec), 1424.9175328977835
[TOTAL_GCS_PS_Scavenge], Count, 209.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 419.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.29852022314208565
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 209.0
[TOTAL_GC_TIME], Time(ms), 419.0
[TOTAL_GC_TIME_%], Time(%), 0.29852022314208565
[READ], Operations, 193704.0
[READ], AverageLatency(us), 472.8018058480981
[READ], MinLatency(us), 235.0
[READ], MaxLatency(us), 48159.0
[READ], 95thPercentileLatency(us), 585.0
[READ], 99thPercentileLatency(us), 816.0
[READ], Return=OK, 193704
[READ], Return=NOT_FOUND, 6296
[READ-MODIFY-WRITE], Operations, 100400.0
[READ-MODIFY-WRITE], AverageLatency(us), 881.2272908366534
[READ-MODIFY-WRITE], MinLatency(us), 524.0
[READ-MODIFY-WRITE], MaxLatency(us), 49087.0
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 1076.0
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1638.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2247680.0
[CLEANUP], MinLatency(us), 2246656.0
[CLEANUP], MaxLatency(us), 2248703.0
[CLEANUP], 95thPercentileLatency(us), 2248703.0
[CLEANUP], 99thPercentileLatency(us), 2248703.0
[UPDATE], Operations, 100400.0
[UPDATE], AverageLatency(us), 405.9424103585657
[UPDATE], MinLatency(us), 208.0
[UPDATE], MaxLatency(us), 46655.0
[UPDATE], 95thPercentileLatency(us), 501.0
[UPDATE], 99thPercentileLatency(us), 671.0
[UPDATE], Return=OK, 100400
[READ-FAILED], Operations, 6296.0
[READ-FAILED], AverageLatency(us), 406.5887865311309
[READ-FAILED], MinLatency(us), 218.0
[READ-FAILED], MaxLatency(us), 21551.0
[READ-FAILED], 95thPercentileLatency(us), 510.0
[READ-FAILED], 99thPercentileLatency(us), 708.0