Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/cassandra2-cql_workloadf_600000_run_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 372596.0
[OVERALL], Throughput(ops/sec), 1610.323245552824
[TOTAL_GCS_PS_Scavenge], Count, 844.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1440.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.38647757893267776
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 844.0
[TOTAL_GC_TIME], Time(ms), 1440.0
[TOTAL_GC_TIME_%], Time(%), 0.38647757893267776
[READ], Operations, 319816.0
[READ], AverageLatency(us), 439.0909741851565
[READ], MinLatency(us), 223.0
[READ], MaxLatency(us), 34495.0
[READ], 95thPercentileLatency(us), 539.0
[READ], 99thPercentileLatency(us), 641.0
[READ], Return=OK, 319816
[READ], Return=NOT_FOUND, 280184
[READ-MODIFY-WRITE], Operations, 300309.0
[READ-MODIFY-WRITE], AverageLatency(us), 805.0038593581944
[READ-MODIFY-WRITE], MinLatency(us), 441.0
[READ-MODIFY-WRITE], MaxLatency(us), 78207.0
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 972.0
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1259.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2239488.0
[CLEANUP], MinLatency(us), 2238464.0
[CLEANUP], MaxLatency(us), 2240511.0
[CLEANUP], 95thPercentileLatency(us), 2240511.0
[CLEANUP], 99thPercentileLatency(us), 2240511.0
[READ-FAILED], Operations, 280184.0
[READ-FAILED], AverageLatency(us), 386.6102668246581
[READ-FAILED], MinLatency(us), 190.0
[READ-FAILED], MaxLatency(us), 75903.0
[READ-FAILED], 95thPercentileLatency(us), 476.0
[READ-FAILED], 99thPercentileLatency(us), 609.0
[UPDATE], Operations, 300309.0
[UPDATE], AverageLatency(us), 385.5621709639072
[UPDATE], MinLatency(us), 190.0
[UPDATE], MaxLatency(us), 30079.0
[UPDATE], 95thPercentileLatency(us), 473.0
[UPDATE], 99thPercentileLatency(us), 581.0
[UPDATE], Return=OK, 300309