Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/mongodb_workloada_800000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 982002.0
[OVERALL], Throughput(ops/sec), 814.662291930159
[TOTAL_GCS_PS_Scavenge], Count, 486.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1009.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1027492815696913
[TOTAL_GCS_PS_MarkSweep], Count, 1.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 89.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.00906311799772302
[TOTAL_GCs], Count, 487.0
[TOTAL_GC_TIME], Time(ms), 1098.0
[TOTAL_GC_TIME_%], Time(%), 0.11181239956741432
[READ], Operations, 399744.0
[READ], AverageLatency(us), 1226.8866274415625
[READ], MinLatency(us), 83.0
[READ], MaxLatency(us), 2.5952255E7
[READ], 95thPercentileLatency(us), 498.0
[READ], 99thPercentileLatency(us), 4471.0
[READ], Return=OK, 399744
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 90656.0
[CLEANUP], MinLatency(us), 90624.0
[CLEANUP], MaxLatency(us), 90687.0
[CLEANUP], 95thPercentileLatency(us), 90687.0
[CLEANUP], 99thPercentileLatency(us), 90687.0
[UPDATE], Operations, 400256.0
[UPDATE], AverageLatency(us), 1217.6095224056603
[UPDATE], MinLatency(us), 128.0
[UPDATE], MaxLatency(us), 1.3942783E7
[UPDATE], 95thPercentileLatency(us), 627.0
[UPDATE], 99thPercentileLatency(us), 4823.0
[UPDATE], Return=OK, 400256