Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/mongodb_workloadf_200000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 55718.0
[OVERALL], Throughput(ops/sec), 3589.504289457626
[TOTAL_GCS_PS_Scavenge], Count, 65.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 256.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4594565490505761
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 65.0
[TOTAL_GC_TIME], Time(ms), 256.0
[TOTAL_GC_TIME_%], Time(%), 0.4594565490505761
[READ], Operations, 200000.0
[READ], AverageLatency(us), 149.659695
[READ], MinLatency(us), 80.0
[READ], MaxLatency(us), 651263.0
[READ], 95thPercentileLatency(us), 205.0
[READ], 99thPercentileLatency(us), 359.0
[READ], Return=OK, 200000
[READ-MODIFY-WRITE], Operations, 99703.0
[READ-MODIFY-WRITE], AverageLatency(us), 397.8816785853986
[READ-MODIFY-WRITE], MinLatency(us), 212.0
[READ-MODIFY-WRITE], MaxLatency(us), 3162111.0
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 481.0
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 945.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 4194.0
[CLEANUP], MinLatency(us), 4192.0
[CLEANUP], MaxLatency(us), 4195.0
[CLEANUP], 95thPercentileLatency(us), 4195.0
[CLEANUP], 99thPercentileLatency(us), 4195.0
[UPDATE], Operations, 99703.0
[UPDATE], AverageLatency(us), 236.6839914546202
[UPDATE], MinLatency(us), 123.0
[UPDATE], MaxLatency(us), 3160063.0
[UPDATE], 95thPercentileLatency(us), 272.0
[UPDATE], 99thPercentileLatency(us), 464.0
[UPDATE], Return=OK, 99703