Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Run/mongodb_workloadf_800000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 814549.0
[OVERALL], Throughput(ops/sec), 982.1385822092961
[TOTAL_GCS_PS_Scavenge], Count, 731.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1318.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.16180733141898154
[TOTAL_GCS_PS_MarkSweep], Count, 2.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 112.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.013749940150930147
[TOTAL_GCs], Count, 733.0
[TOTAL_GC_TIME], Time(ms), 1430.0
[TOTAL_GC_TIME_%], Time(%), 0.1755572715699117
[READ], Operations, 800000.0
[READ], AverageLatency(us), 902.758215
[READ], MinLatency(us), 81.0
[READ], MaxLatency(us), 4040703.0
[READ], 95thPercentileLatency(us), 1628.0
[READ], 99thPercentileLatency(us), 4879.0
[READ], Return=OK, 800000
[READ-MODIFY-WRITE], Operations, 400258.0
[READ-MODIFY-WRITE], AverageLatency(us), 1164.8745084420548
[READ-MODIFY-WRITE], MinLatency(us), 211.0
[READ-MODIFY-WRITE], MaxLatency(us), 4042751.0
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 1893.0
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 5523.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 97632.0
[CLEANUP], MinLatency(us), 97600.0
[CLEANUP], MaxLatency(us), 97663.0
[CLEANUP], 95thPercentileLatency(us), 97663.0
[CLEANUP], 99thPercentileLatency(us), 97663.0
[UPDATE], Operations, 400258.0
[UPDATE], AverageLatency(us), 217.8097676998336
[UPDATE], MinLatency(us), 120.0
[UPDATE], MaxLatency(us), 1323007.0
[UPDATE], 95thPercentileLatency(us), 280.0
[UPDATE], 99thPercentileLatency(us), 421.0
[UPDATE], Return=OK, 400258